In [90]:
# dictionary

#create a small dictinary 
#store names of 4 students and their marks

student_marks = {
    #key : value
    'Ahmad':78,
    'Siti':88,
    'Bob':85,
    'John':90
    }


print(student_marks)

# to access value by key

print(student_marks['Ahmad'])

for student, marks in student_marks.items():
    print(f"{student}:{marks}")

{'Ahmad': 78, 'Siti': 88, 'Bob': 85, 'John': 90}
78
Ahmad:78
Siti:88
Bob:85
John:90

In [91]:
students_grades= {
    "name": ["Idrees","Mel","Ibrahim","Hazirah","Amin"], # to fill it with anything
    "maths":[90,90,90,92,94],
    "english":[90,90,90,92,94],
    "science":[90,90,90,92,94]
}
print(students_grades)

{'name': ['Idrees', 'Mel', 'Ibrahim', 'Hazirah', 'Amin'], 'maths': [90, 90, 90, 92, 94], 'english': [90, 90, 90, 92, 94], 'science': [90, 90, 90, 92, 94]}

In [92]:
students_grades["name"][2] # [index] access

'Ibrahim'

In [93]:
pip install pandas

Requirement already satisfied: pandas in c:\users\user\appdata\local\programs\python\python314\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\appdata\roaming\python\python314\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\appdata\local\programs\python\python314\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\user\appdata\roaming\python\python314\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [94]:
import pandas as pd
#create table

#method to create dataframe
df = pd.DataFrame(students_grades)

df

print("\n first table -------\n",df,"\n")
print("\n second table -----------\n",df,)
print("\n third table -----------\n",df)

 first table -------
       name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Ibrahim     90       90       90
3  Hazirah     92       92       92
4     Amin     94       94       94


 second table -----------
       name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Ibrahim     90       90       90
3  Hazirah     92       92       92
4     Amin     94       94       94

 third table -----------
       name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Ibrahim     90       90       90
3  Hazirah     92       92       92
4     Amin     94       94       94

In [95]:
type(df)

pandas.core.frame.DataFrame

In [96]:
df.head() # (), 5 is the default argument
#(2) gives 2 rows

      name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Ibrahim     90       90       90
3  Hazirah     92       92       92
4     Amin     94       94       94

In [97]:
#last two
df.tail(2)

      name  maths  english  science
3  Hazirah     92       92       92
4     Amin     94       94       94

In [98]:
# access certain columns in dataframes too
print("names column ---------\n",df["name"])
print("maths column ---------\n",df["maths"])

names column ---------
 0     Idrees
1        Mel
2    Ibrahim
3    Hazirah
4       Amin
Name: name, dtype: object
maths column ---------
 0    90
1    90
2    90
3    92
4    94
Name: maths, dtype: int64

In [99]:
#access particular column
df["maths"][3]

np.int64(92)

In [100]:
#series is like a list
marks_series = pd.Series([1,2,3,4,5])
#type(marks_series)

print(marks_series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [101]:
df

      name  maths  english  science
0   Idrees     90       90       90
1      Mel     90       90       90
2  Ibrahim     90       90       90
3  Hazirah     92       92       92
4     Amin     94       94       94

In [102]:
#HOW MANY MARKS DOES AMIN HAS IN ENGLISH?
print(df["english"][4])

#
print(f"In English {df.name[3]} has {df.english[3]} marks")

#orrr
hz=df["name"][3]
hz_mark=df["english"][3]

print(f"In english {hz} has {hz_mark} marks")

94
In English Hazirah has 92 marks
In english Hazirah has 92 marks

In [103]:
#core data types in pandas
#dataframe
#series (1D df)

In [ ]:
#create a series of data using pd.series 5 values of temperature


temp11 = pd.Series([12,30,45,80,60])
print(temp11)
print(type(temp11))

0    12
1    30
2    45
3    80
4    60
dtype: int64
<class 'pandas.core.series.Series'>

In [158]:
#create 1 dataframe with two columns, city and temperature - 5 cities

#creating a dictionary,a python object
city_temp = {
    "city":["KL","NY","Jakarta","Delhi","Hong Kong"], #list of cities
    "temp10":[45,32,87,67,54]
}


#dataframe is pandas object
temp_df=pd.DataFrame(city_temp)

print(type(temp_df))

<class 'pandas.core.frame.DataFrame'>

In [160]:
#series object - single columns,1D column
temp_df #dataframe
temp11 # series

0    12
1    30
2    45
3    80
4    60
dtype: int64

In [163]:
temp_df

        city  temp10
0         KL      45
1         NY      32
2    Jakarta      87
3      Delhi      67
4  Hong Kong      54

In [164]:
temp_df["temp11"] = temp11 # or pd.Series([]) # creates new column

#series and dict are almost same

#to change values 
#temp_df["city"]={}

In [165]:
temp_df

        city  temp10  temp11
0         KL      45      12
1         NY      32      30
2    Jakarta      87      45
3      Delhi      67      80
4  Hong Kong      54      60

In [168]:
temp_df["empty_temp"] = pd.Series([]) # list is empty. but can also be filled with values inside the square bracket

In [169]:
temp_df

        city  temp10  temp11 empty_temp
0         KL      45      12        NaN
1         NY      32      30        NaN
2    Jakarta      87      45        NaN
3      Delhi      67      80        NaN
4  Hong Kong      54      60        NaN

In [171]:
#how to export as csv file (namefile)
temp_df.to_csv("City Rating.csv")

In [ ]:
temp_df.to_csv("City Rating eithout row numners.csv",index=False) # no need to export indec

In [ ]:
df["city"].value_counts() # return unique values

city
KL           1
NY           1
Jakarta      1
Delhi        1
Hong Kong    1
Name: count, dtype: int64

In [ ]:
df["city"].unique() # like set,

array(['KL', 'NY', 'Jakarta', 'Delhi', 'Hong Kong'], dtype=object)

In [ ]:
df["city"].duplicated() # find values is repeated or not

<bound method Series.duplicated of 0           KL
1           NY
2      Jakarta
3        Delhi
4    Hong Kong
Name: city, dtype: object>

In [178]:
data = {
    "cities": ["KL","KL","KL","NY","HLS"],
    "temp10": [23,29,40,0,5]
}

df=pd.DataFrame(data)
df

  cities  temp10
0     KL      23
1     KL      29
2     KL      40
3     NY       0
4    HLS       5

In [181]:
df["cities"].value_counts()

cities
KL     3
NY     1
HLS    1
Name: count, dtype: int64

In [182]:
df["cities"].unique()

array(['KL', 'NY', 'HLS'], dtype=object)

In [185]:
df

  cities  temp10
0     KL      23
1     KL      29
2     KL      40
3     NY       0
4    HLS       5

In [187]:
df["cities"].duplicated()

0    False
1     True
2     True
3    False
4    False
Name: cities, dtype: bool

In [ ]:
df2 = df["cities"].drop_duplicates() # remove duplicates
df2

0     KL
3     NY
4    HLS
Name: cities, dtype: object